turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/sam4cp/atdf/ATSAM4CP16B_1.atdf
        <register caption="Peripheral Clock Status Register 0" name="PMC_PCSR0" offset="0x0018" rw="R" size="4">
          <bitfield caption="Peripheral Clock 8 Status" mask="0x00000100" name="PID8"/>
          <bitfield caption="Peripheral Clock 9 Status" mask="0x00000200" name="PID9"/>
          <bitfield caption="Peripheral Clock 10 Status" mask="0x00000400" name="PID10"/>
          <bitfield caption="Peripheral Clock 11 Status" mask="0x00000800" name="PID11"/>
          <bitfield caption="Peripheral Clock 12 Status" mask="0x00001000" name="PID12"/>
          <bitfield caption="Peripheral Clock 13 Status" mask="0x00002000" name="PID13"/>
          <bitfield caption="Peripheral Clock 14 Status" mask="0x00004000" name="PID14"/>
          <bitfield caption="Peripheral Clock 15 Status" mask="0x00008000" name="PID15"/>
          <bitfield caption="Peripheral Clock 16 Status" mask="0x00010000" name="PID16"/>
          <bitfield caption="Peripheral Clock 17 Status" mask="0x00020000" name="PID17"/>
          <bitfield caption="Peripheral Clock 18 Status" mask="0x00040000" name="PID18"/>
          <bitfield caption="Peripheral Clock 19 Status" mask="0x00080000" name="PID19"/>
          <bitfield caption="Peripheral Clock 20 Status" mask="0x00100000" name="PID20"/>
          <bitfield caption="Peripheral Clock 21 Status" mask="0x00200000" name="PID21"/>
          <bitfield caption="Peripheral Clock 23 Status" mask="0x00800000" name="PID23"/>
          <bitfield caption="Peripheral Clock 24 Status" mask="0x01000000" name="PID24"/>
          <bitfield caption="Peripheral Clock 25 Status" mask="0x02000000" name="PID25"/>
          <bitfield caption="Peripheral Clock 26 Status" mask="0x04000000" name="PID26"/>
          <bitfield caption="Peripheral Clock 27 Status" mask="0x08000000" name="PID27"/>
          <bitfield caption="Peripheral Clock 28 Status" mask="0x10000000" name="PID28"/>
          <bitfield caption="Peripheral Clock 29 Status" mask="0x20000000" name="PID29"/>
          <bitfield caption="Peripheral Clock 31 Status" mask="0x80000000" name="PID31"/>
        </register>
        <register caption="Main Oscillator Register" name="CKGR_MOR" offset="0x0020" rw="RW" size="4">
          <bitfield caption="Main Crystal Oscillator Enable" mask="0x00000001" name="MOSCXTEN"/>
          <bitfield caption="Main Crystal Oscillator Bypass" mask="0x00000002" name="MOSCXTBY"/>
          <bitfield caption="Wait Mode Command" mask="0x00000004" name="WAITMODE"/>
          <bitfield caption="Main On-Chip RC Oscillator Enable" mask="0x00000008" name="MOSCRCEN"/>
          <bitfield caption="Main On-Chip RC Oscillator Frequency Selection" mask="0x00000070" name="MOSCRCF" values="CKGR_MOR__MOSCRCF"/>
          <bitfield caption="Main Crystal Oscillator Start-up Time" mask="0x0000FF00" name="MOSCXTST"/>
          <bitfield caption="Write Access Password" mask="0x00FF0000" name="KEY" values="CKGR_MOR__KEY"/>
          <bitfield caption="Main Oscillator Selection" mask="0x01000000" name="MOSCSEL"/>
          <bitfield caption="Clock Failure Detector Enable" mask="0x02000000" name="CFDEN"/>
          <bitfield caption="Slow Crystal Oscillator Frequency Monitoring Enable" mask="0x04000000" name="XT32KFME"/>
        </register>
        <register caption="Main Clock Frequency Register" name="CKGR_MCFR" offset="0x0024" rw="RW" size="4">
          <bitfield caption="Main Clock Frequency" mask="0x0000FFFF" name="MAINF"/>
          <bitfield caption="Main Clock Ready" mask="0x00010000" name="MAINFRDY"/>
          <bitfield caption="RC Oscillator Frequency Measure (write-only)" mask="0x00100000" name="RCMEAS"/>
        </register>
        <register caption="PLLA Register" name="CKGR_PLLAR" offset="0x0028" rw="RW" size="4">
          <bitfield caption="PLLA Control" mask="0x000000FF" name="PLLAEN"/>
          <bitfield caption="PLLA Counter" mask="0x00003F00" name="PLLACOUNT"/>
          <bitfield caption="PLLA Multiplier" mask="0x07FF0000" name="MULA"/>
        </register>
        <register caption="PLLB Register" name="CKGR_PLLBR" offset="0x002C" rw="RW" size="4">
          <bitfield caption="PLLB Front-End Divider" mask="0x000000FF" name="DIVB"/>
          <bitfield caption="PLLB Counter" mask="0x00003F00" name="PLLBCOUNT"/>
          <bitfield caption="PLLB Multiplier" mask="0x07FF0000" name="MULB"/>
          <bitfield caption="Source for PLLB" mask="0x20000000" name="SRCB" values="CKGR_PLLBR__SRCB"/>
        </register>
        <register caption="Master Clock Register" name="PMC_MCKR" offset="0x0030" rw="RW" size="4">
          <bitfield caption="Master Clock Source Selection" mask="0x00000003" name="CSS" values="PMC_MCKR__CSS"/>
          <bitfield caption="Processor Clock Prescaler" mask="0x00000070" name="PRES" values="PMC_MCKR__PRES"/>
          <bitfield caption="PLLA Divisor by 2" mask="0x00001000" name="PLLADIV2"/>
          <bitfield caption="" mask="0x00002000" name="PLLBDIV2"/>
          <bitfield caption="Coprocessor Master Clock Source Selection" mask="0x00070000" name="CPCSS" values="PMC_MCKR__CPCSS"/>
          <bitfield caption="Coprocessor Programmable Clock Prescaler" mask="0x00F00000" name="CPPRES"/>
        </register>
        <register caption="Programmable Clock 0 Register 0" name="PMC_PCK0" offset="0x40" rw="RW" size="4">
          <bitfield caption="Master Clock Source Selection" mask="0x00000007" name="CSS" values="PMC_PCK__CSS"/>
          <bitfield caption="Programmable Clock Prescaler" mask="0x00000070" name="PRES" values="PMC_PCK__PRES"/>
        </register>
        <register caption="Programmable Clock 0 Register 1" name="PMC_PCK1" offset="0x44" rw="RW" size="4">
          <bitfield caption="Master Clock Source Selection" mask="0x00000007" name="CSS" values="PMC_PCK__CSS"/>
          <bitfield caption="Programmable Clock Prescaler" mask="0x00000070" name="PRES" values="PMC_PCK__PRES"/>
        </register>
        <register caption="Programmable Clock 0 Register 2" name="PMC_PCK2" offset="0x48" rw="RW" size="4">
          <bitfield caption="Master Clock Source Selection" mask="0x00000007" name="CSS" values="PMC_PCK__CSS"/>
          <bitfield caption="Programmable Clock Prescaler" mask="0x00000070" name="PRES" values="PMC_PCK__PRES"/>
        </register>
        <register caption="Interrupt Enable Register" name="PMC_IER" offset="0x0060" rw="W" size="4">
          <bitfield caption="Main Crystal Oscillator Status Interrupt Enable" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Interrupt Enable" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="PLLB Lock Interrupt Enable" mask="0x00000004" name="LOCKB"/>
          <bitfield caption="Master Clock Ready Interrupt Enable" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="Programmable Clock Ready 0 Interrupt Enable" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready 1 Interrupt Enable" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready 2 Interrupt Enable" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Main Oscillator Selection Status Interrupt Enable" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main On-Chip RC Status Interrupt Enable" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event Interrupt Enable" mask="0x00040000" name="CFDEV"/>
          <bitfield caption="Slow Crystal Oscillator Error Interrupt Enable" mask="0x00200000" name="XT32KERR"/>
        </register>
        <register caption="Interrupt Disable Register" name="PMC_IDR" offset="0x0064" rw="W" size="4">
          <bitfield caption="Main Crystal Oscillator Status Interrupt Disable" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Interrupt Disable" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="PLLB Lock Interrupt Disable" mask="0x00000004" name="LOCKB"/>
          <bitfield caption="Master Clock Ready Interrupt Disable" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="Programmable Clock Ready 0 Interrupt Disable" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready 1 Interrupt Disable" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready 2 Interrupt Disable" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Main Oscillator Selection Status Interrupt Disable" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main On-Chip RC Status Interrupt Disable" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event Interrupt Disable" mask="0x00040000" name="CFDEV"/>
          <bitfield caption="Slow Crystal Oscillator Error Interrupt Disable" mask="0x00200000" name="XT32KERR"/>
        </register>
        <register caption="Status Register" name="PMC_SR" offset="0x0068" rw="R" size="4">
          <bitfield caption="Main XTAL Oscillator Status" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Status" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="PLLB Lock Status" mask="0x00000004" name="LOCKB"/>
          <bitfield caption="Master Clock Status" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="Slow Clock Oscillator Selection" mask="0x00000080" name="OSCSELS"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Main Oscillator Selection Status" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main On-Chip RC Oscillator Status" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event" mask="0x00040000" name="CFDEV"/>
          <bitfield caption="Clock Failure Detector Status" mask="0x00080000" name="CFDS"/>
          <bitfield caption="Clock Failure Detector Fault Output Status" mask="0x00100000" name="FOS"/>
          <bitfield caption="Slow Crystal Oscillator Error" mask="0x00200000" name="XT32KERR"/>
        </register>
        <register caption="Interrupt Mask Register" name="PMC_IMR" offset="0x006C" rw="R" size="4">
          <bitfield caption="Main Crystal Oscillator Status Interrupt Mask" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Interrupt Mask" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="PLLB Lock Interrupt Mask" mask="0x00000004" name="LOCKB"/>
          <bitfield caption="Master Clock Ready Interrupt Mask" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="Programmable Clock Ready 0 Interrupt Mask" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready 1 Interrupt Mask" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Programmable Clock Ready 2 Interrupt Mask" mask="0x00000400" name="PCKRDY2"/>
          <bitfield caption="Main Oscillator Selection Status Interrupt Mask" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main On-Chip RC Status Interrupt Mask" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event Interrupt Mask" mask="0x00040000" name="CFDEV"/>
          <bitfield caption="Slow Crystal Oscillator Error Interrupt Mask" mask="0x00200000" name="XT32KERR"/>
        </register>
        <register caption="Fast Start-up Mode Register" name="PMC_FSMR" offset="0x0070" rw="RW" size="4">
          <bitfield caption="Fast Start-up Input Enable 0" mask="0x00000001" name="FSTT0"/>
          <bitfield caption="Fast Start-up Input Enable 1" mask="0x00000002" name="FSTT1"/>
          <bitfield caption="Fast Start-up Input Enable 2" mask="0x00000004" name="FSTT2"/>
          <bitfield caption="Fast Start-up Input Enable 3" mask="0x00000008" name="FSTT3"/>
          <bitfield caption="Fast Start-up Input Enable 4" mask="0x00000010" name="FSTT4"/>
          <bitfield caption="Fast Start-up Input Enable 5" mask="0x00000020" name="FSTT5"/>
          <bitfield caption="Fast Start-up Input Enable 6" mask="0x00000040" name="FSTT6"/>
          <bitfield caption="Fast Start-up Input Enable 7" mask="0x00000080" name="FSTT7"/>
          <bitfield caption="Fast Start-up Input Enable 8" mask="0x00000100" name="FSTT8"/>
          <bitfield caption="Fast Start-up Input Enable 9" mask="0x00000200" name="FSTT9"/>
          <bitfield caption="Fast Start-up Input Enable 10" mask="0x00000400" name="FSTT10"/>
          <bitfield caption="Fast Start-up Input Enable 11" mask="0x00000800" name="FSTT11"/>
          <bitfield caption="Fast Start-up Input Enable 12" mask="0x00001000" name="FSTT12"/>
          <bitfield caption="Fast Start-up Input Enable 13" mask="0x00002000" name="FSTT13"/>
          <bitfield caption="Fast Start-up Input Enable 14" mask="0x00004000" name="FSTT14"/>
          <bitfield caption="Fast Start-up Input Enable 15" mask="0x00008000" name="FSTT15"/>
          <bitfield caption="RTT Alarm Enable" mask="0x00010000" name="RTTAL"/>
          <bitfield caption="RTC Alarm Enable" mask="0x00020000" name="RTCAL"/>
          <bitfield caption="Low Power Mode" mask="0x00100000" name="LPM"/>
          <bitfield caption="Flash Low Power Mode" mask="0x00600000" name="FLPM" values="PMC_FSMR__FLPM"/>
        </register>
        <register caption="Fast Start-up Polarity Register" name="PMC_FSPR" offset="0x0074" rw="RW" size="4">
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00000001" name="FSTP0"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00000002" name="FSTP1"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00000004" name="FSTP2"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00000008" name="FSTP3"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00000010" name="FSTP4"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00000020" name="FSTP5"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00000040" name="FSTP6"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00000080" name="FSTP7"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00000100" name="FSTP8"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00000200" name="FSTP9"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00000400" name="FSTP10"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00000800" name="FSTP11"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00001000" name="FSTP12"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00002000" name="FSTP13"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00004000" name="FSTP14"/>
          <bitfield caption="Fast Start-up Input Polarityx" mask="0x00008000" name="FSTP15"/>
        </register>
